{
  "</tool_call>": 151658,
  "<B_APE>": 151671,
  "<B_CODE>": 151670,
  "<B_FUNC>": 151669,
  "<B_SYS>": 151665,
  "<B_USYS>": 151666,
  "<C_A>": 151668,
  "<C_Q>": 151667,
  "<audio_delim_baichuan>": 151693,
  "<audio_end_baichuan>": 151677,
  "<audio_pad_baichuan>": 151678,
  "<audio_start_baichuan>": 151676,
  "<audiogen_end_baichuan>": 151701,
  "<audiogen_start_baichuan>": 151700,
  "<audiotext_end_baichuan>": 151698,
  "<audiotext_pad_baichuan>": 151699,
  "<audiotext_start_baichuan>": 151697,
  "<baichuan_pad_token>": 151691,
  "<box_delim_baichuan>": 151685,
  "<box_end_baichuan>": 151684,
  "<box_start_baichuan>": 151683,
  "<calc_end>": 151674,
  "<calc_start>": 151673,
  "<function_calling>": 151672,
  "<img_delim_baichuan>": 151688,
  "<img_end_baichuan>": 151680,
  "<img_newline_baichuan>": 151682,
  "<img_pad_baichuan>": 151681,
  "<img_start_baichuan>": 151679,
  "<inner_think>": 151675,
  "<polygon_end_baichuan>": 151690,
  "<polygon_start_baichuan>": 151689,
  "<ref_end_baichuan>": 151687,
  "<ref_start_baichuan>": 151686,
  "<reserved_113>": 151692,
  "<tool_call>": 151657,
  "<video_end_baichuan>": 151696,
  "<video_palce_baichuan>": 151694,
  "<video_start_baichuan>": 151695,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
