{
  "additional_special_tokens": [
    "<|im_start|>",
    "<|im_end|>",
    "<|object_ref_start|>",
    "<|object_ref_end|>",
    "<|box_start|>",
    "<|box_end|>",
    "<|quad_start|>",
    "<|quad_end|>",
    "<|vision_start|>",
    "<|vision_end|>",
    "<|vision_pad|>",
    "<|image_pad|>",
    "<|video_pad|>",
    "<B_SYS>",
    "<B_USYS>",
    "<C_Q>",
    "<C_A>",
    "<B_FUNC>",
    "<B_CODE>",
    "<B_APE>",
    "<function_calling>",
    "<calc_start>",
    "<calc_end>",
    "<inner_think>",
    "<audio_start_baichuan>",
    "<audio_end_baichuan>",
    "<audio_pad_baichuan>",
    "<img_start_baichuan>",
    "<img_end_baichuan>",
    "<img_pad_baichuan>",
    "<img_newline_baichuan>",
    "<box_start_baichuan>",
    "<box_end_baichuan>",
    "<box_delim_baichuan>",
    "<ref_start_baichuan>",
    "<ref_end_baichuan>",
    "<img_delim_baichuan>",
    "<polygon_start_baichuan>",
    "<polygon_end_baichuan>",
    "<baichuan_pad_token>",
    "<reserved_113>",
    "<audio_delim_baichuan>",
    "<video_start_baichuan>",
    "<video_end_baichuan>",
    "<video_palce_baichuan>",
    "<audiotext_start_baichuan>",
    "<audiotext_end_baichuan>",
    "<audiotext_pad_baichuan>",
    "<audiogen_start_baichuan>",
    "<audiogen_end_baichuan>"
  ],
  "eos_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
